using Microsoft.VisualStudio.TestTools.UnitTesting;
using System;
using Tyuiu.BotanogovDS.Sprint7.V8.Lib;

namespace Tyuiu.BotanogovDS.Sprint7.V8.Test
{
    [TestClass]
    public class DataServiceTest
    {
        DataService ds = new DataService();

        [TestMethod]
        public void TestArrayStrWordsElements()
        {
            string[,] DataTabl =
            {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
            };



            string[] res = ds.ArrayStrWordsElements(DataTabl, 4);
            string[] wait = { "мерс", "лада", "тоета" };
            CollectionAssert.AreEqual(wait, res);
        }



        [TestMethod]
        public void TestArraySumWords()
        {
            string[,] DataTabl =
            {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
            };



            int[] res = ds.ArraySumWords(DataTabl, ds.ArrayStrWordsElements(DataTabl, 4), 4);
            int[] wait = { 2, 1, 1 };
            CollectionAssert.AreEqual(wait, res);
        }



        [TestMethod]
        public void TestAverage()
        {
            string[,] DataTabl =
           {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
            };


            double res = ds.Average(DataTabl, 5);
            double wait = 16;
            Assert.AreEqual(res, wait);
        }


        [TestMethod]
        public void TestSortMin()
        {
            string[,] DataTabl =
            {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
            };

            string[,] res = ds.SortMin(DataTabl, 2);

            string[,] wait =
            {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                
           
            };

            CollectionAssert.AreEqual(res, wait);
        }



        [TestMethod]
        public void TestSortMax()
        {
            string[,] DataTabl =
            {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
            };

            string[,] res = ds.SortMax(DataTabl, 2);

            string[,] wait =
            {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
            };

            CollectionAssert.AreEqual(res, wait);
        }



        [TestMethod]
        public void TestSearch()
        {
            string[,] DataTabl =
            {
                {"ID","ФИО","Стаж","Номер авто","Марка авто","Расзод топлива","Пробег" },
                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },
                {"3","пккеп пкепке епке","11","й456ек","лада","24","120000" },
                {"4","пекпекп кеп кепекп","5","Ф432АК","тоета","9","0" },
            };

            string[,] res = ds.Search(DataTabl, "мерс");

            string[,] wait =
            {

                {"1","пкупу п упу пук","10","н589рп","мерс","15","10000" },
                {"2","ппекь пьзекь ппкепк","12","е758ав","мерс","16","12000" },

            };

            CollectionAssert.AreEqual(res, wait);
        }
    }
}
